DataProcessors/КонтактнаяИнформацияРеализацииТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>КонтактнаяИнформацияРеализацииТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>cfg:InformationRegisterRecordManager.КонтактнаяИнформация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>cfg:InformationRegisterRecordManager.КонтактнаяИнформация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонДополнительный</Name>
					<Type>
						<v8:Type>cfg:InformationRegisterRecordManager.КонтактнаяИнформация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформацияРеализацииТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформацияРеализацииТоваровУслуг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторГородов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторГородов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторГородов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторГородов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторУлиц</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Поиск</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/МодулиИПодсистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>МодулиИПодсистемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ресторан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПраваДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ПраваДоступаПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запретить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разрешить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Привилегированные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/КонтактнаяИнформацияРеализацииТоваровУслуг/Ext/ObjectModule.bsl
// Процедура считывает контактную информацию связанную с владельцем.
//
Процедура Прочитать(Владелец, ОбъектКопирования = Неопределено) Экспорт

	// Выборка данных.
	Если (ОбъектКопирования = Неопределено) Тогда
		Документ = Владелец.Ссылка;
	Иначе
		Документ = ОбъектКопирования.Ссылка;
	КонецЕсли;
	
	Запись = РегистрыСведений.КонтактнаяИнформацияРеализацииТоваровУслуг.Выбрать(Новый Структура("Документ", Документ));
	
	Пока Запись.Следующий() Цикл
		
		// Адрес доставки.
		Если (Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес) И (Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресДоставкиРеализацииТоваровУслуг) Тогда
			УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(АдресДоставки, УправлениеКонтактнойИнформацией.ПолучитьСтруктуруЗаписиРегистра(Запись));
		КонецЕсли;
		
		Если (Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон) Тогда
		
			// Телефон.
			Если (Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРеализацииТоваровУслуг) Тогда
				УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(Телефон, УправлениеКонтактнойИнформацией.ПолучитьСтруктуруЗаписиРегистра(Запись));
			КонецЕсли;
			
			// Телефон дополнительный.
			Если (Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДополнительныйРеализацииТоваровУслуг) Тогда
				УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(ТелефонДополнительный, УправлениеКонтактнойИнформацией.ПолучитьСтруктуруЗаписиРегистра(Запись));
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // Прочитать()

// Процедура записывает требуемую контактную информацию связанную с владельцем.
//
Процедура Записать(Владелец, Отказ) Экспорт
	
	// Отказ.
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск.
	АдресДоставки.Поиск = УправлениеКонтактнойИнформацией.ПолучитьПоискАдреса(АдресДоставки);
	Телефон.Поиск = УправлениеКонтактнойИнформацией.ПолучитьПоискТелефона(Телефон);
	ТелефонДополнительный.Поиск = УправлениеКонтактнойИнформацией.ПолучитьПоискТелефона(ТелефонДополнительный);
	
	// Набор записей.
	Документ = Владелец.Ссылка;
	
	//Если (ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПокупателя")) Тогда
	//	НаборЗаписей = РегистрыСведений.КонтактнаяИнформацияЗаказовПокупателей.СоздатьНаборЗаписей();
	//Иначе
	//	НаборЗаписей = РегистрыСведений.КонтактнаяИнформацияРеализацииТоваровУслуг.СоздатьНаборЗаписей();
	//КонецЕсли;
	
	//Костенюк Александр-Старт 22.05.2012
	НаборЗаписей = РегистрыСведений.КонтактнаяИнформацияРеализацииТоваровУслуг.СоздатьНаборЗаписей();
	//Костенюк Александр-Финиш 22.05.2012
	
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	
	//Если (Владелец.Модуль = Перечисления.МодулиИПодсистемы.Доставка) Тогда
	//Костенюк Александр-Старт 22.05.2012
	ПравоИзменениеКонтактнойИнформацииЗаказов = УправлениеПользователями.ПолучитьЗначениеПрава(ПланыВидовХарактеристик.ПраваПользователей.FrontOfficeИзменениеКонтактнойИнформацииЗаказов);
	Если (Владелец.Модуль = Перечисления.МодулиИПодсистемы.Доставка) ИЛИ
		(ПравоИзменениеКонтактнойИнформацииЗаказов = Перечисления.ПраваДоступаПользователей.Разрешить) ИЛИ
		(ПравоИзменениеКонтактнойИнформацииЗаказов = Перечисления.ПраваДоступаПользователей.Привилегированные)
		Тогда
	//Костенюк Александр-Финиш 22.05.2012
		// Адрес доставки.
		Если (АдресДоставки.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес) И (Не УправлениеКонтактнойИнформацией.ПустаяКонтактнаяИнформация(АдресДоставки)) Тогда
			Запись = НаборЗаписей.Добавить();
			УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(Запись, УправлениеКонтактнойИнформацией.ПолучитьСтруктуруЗаписиРегистра(АдресДоставки));
			Запись.Документ = Документ;
			Запись.Объект = Владелец.Контрагент;
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.АдресДоставкиРеализацииТоваровУслуг;
			Запись.ЗначениеПоУмолчанию = Ложь;
		КонецЕсли;
		
		// Телефон.
		Если (Телефон.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон) И (Не УправлениеКонтактнойИнформацией.ПустаяКонтактнаяИнформация(Телефон)) Тогда
			Запись = НаборЗаписей.Добавить();
			УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(Запись, УправлениеКонтактнойИнформацией.ПолучитьСтруктуруЗаписиРегистра(Телефон));
			Запись.Документ = Документ;
			Запись.Объект = Владелец.Контрагент;
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРеализацииТоваровУслуг;
			Запись.ЗначениеПоУмолчанию = Ложь;
		КонецЕсли;
		
		// Телефон дополнительный.
		Если (ТелефонДополнительный.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон) И (Не УправлениеКонтактнойИнформацией.ПустаяКонтактнаяИнформация(ТелефонДополнительный)) Тогда
			Запись = НаборЗаписей.Добавить();
			УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(Запись, УправлениеКонтактнойИнформацией.ПолучитьСтруктуруЗаписиРегистра(ТелефонДополнительный));
			Запись.Документ = Документ;
			Запись.Объект = Владелец.Контрагент;
			Запись.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДополнительныйРеализацииТоваровУслуг;
			Запись.ЗначениеПоУмолчанию = Ложь;
		КонецЕсли;
		
	Иначе
		
		// Очистка контактной информации.
		УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(АдресДоставки, УправлениеКонтактнойИнформацией.ПолучитьПустуюСтруктуруАдреса()); АдресДоставки.Вид = Справочники.ВидыКонтактнойИнформации.АдресДоставкиРеализацииТоваровУслуг;
		УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(Телефон, УправлениеКонтактнойИнформацией.ПолучитьПустуюСтруктуруТелефона()); Телефон.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРеализацииТоваровУслуг;
		УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(ТелефонДополнительный, УправлениеКонтактнойИнформацией.ПолучитьПустуюСтруктуруТелефона()); ТелефонДополнительный.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДополнительныйРеализацииТоваровУслуг;
		
	КонецЕсли;
	
	// Запись.
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра(ОписаниеОшибки(), Отказ, ,, НаборЗаписей, Владелец);
	КонецПопытки;
	
КонецПроцедуры // Записать()


// Инициализация переменных.
УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(АдресДоставки, УправлениеКонтактнойИнформацией.ПолучитьПустуюСтруктуруАдреса()); АдресДоставки.Вид = Справочники.ВидыКонтактнойИнформации.АдресДоставкиРеализацииТоваровУслуг;
УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(Телефон, УправлениеКонтактнойИнформацией.ПолучитьПустуюСтруктуруТелефона()); Телефон.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонРеализацииТоваровУслуг;
УправлениеКонтактнойИнформацией.ЗаполнитьЗаписьРегистраПоСтруктуре(ТелефонДополнительный, УправлениеКонтактнойИнформацией.ПолучитьПустуюСтруктуруТелефона()); ТелефонДополнительный.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонДополнительныйРеализацииТоваровУслуг;
